// Завдання 1:
// Запропонуйте користувачу ввести число за допомогою prompt().
// Збережіть введене значення у змінну number.
// Перевірте, чи дорівнює змінна number числу 10:
//    Якщо так – виведіть повідомлення 'Вірно' у alert().
//    Якщо ні – виведіть 'Невірно'. 

// Підказка: prompt завжди повертає рядок (String), тому перед перевіркою  
// перетворіть значення на число за допомогою Number().

// const number = prompt('Введіть довільне число');
// if (Number(number) === 10) {
//     alert('Вірно');
//     console.log('Вірно');
// } else {
//     alert('Невірно');
//     console.log('Невірно');
// }


// Завдання 2:
// У змінній min лежить випадкове число від 0 до 59.
// Визначте, в яку чверть години потрапляє
// це число (у першу, другу, третю чи четверту).
// Виведіть в alert відповідне повідомлення, наприклад:
// "10 входить в першу чверть"

// const min = Math.floor(Math.random() * 59);

// const min = Math.floor(Math.random() * 59);
// if (min <= 15) {
//     alert(`${min} входить в першу чверть`);
//     console.log(`${min} входить в першу чверть`);
// } else if (min <= 30) {
//     alert(`${min} входить в другу чверть`);
//     console.log(`${min} входить в другу чверть`);
// } else if (min <= 45) {
//     alert(`${min} входить в третю чверть`);
//     console.log(`${min} входить в третю чверть`);
// } else {
//     alert(`${min} входить в четверту чверть`);
//     console.log(`${min} входить в четверту чверть`);
// }


// Завдання 3:
// Змінна num може набувати 4 значення: '1', '2', '3' або '4' 
// (запитуй це значення у користувача через prompt). 
// Якщо вона має значення '1', то у змінну result запишіть 'зима',
// якщо має значення '2' - 'весна' і так далі.
// Розв'яжіть завдання через switch-case.
// Не забудьте про дефолтне значення, на випадок, якщо користувач 
// введе в prompt щось інше. В такому випадку result має набувати значення:
// "Вибачте, але ви маєте ввести значення від 1 до 4 включно".

// Значення змінної result виведіть в консоль.

// let num = prompt('введіть число від 1 до 4');
// let result = 0;
// switch (num) {
//     case '1':
//         result = 'Зима';
//         break;
//     case '2':
//         result = 'Весна';
//         break;
//     case '3':
//         result = 'Літо';
//         break;
//     case '4':
//         result = 'Осінь';
//         break;
//     default:
//         result = 'Вибачте, але ви маєте ввести значення від 1 до 4 включно';
// }
// alert(result);
// console.log(result);
    

// Завдання 4:
// Отримуйте від користувача число (кількість хвилин) через prompt
// і виводьте у консоль рядок у форматі годин та хвилин.
// Приклад: користувач вводить в prompt '70' -> в консолі відобразиться '01:10'.
// Корисне посилання для відображення годин та хвилин у потрібному форматі ('01' замість '1'): 
// https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/String/padStart#examples


// let minutes = prompt('введіть число');
// const hours = Math.floor(minutes / 60);
// const hour = String(hours).padStart(2, '0');
// minutes = Math.floor(minutes) % 60;
// const min = String(minutes).padStart(2, '0');

// alert(`${hour}:${min}`)
// console.log(`${hour}:${min}`);

// Завдання 5:
// Напишіть код, який запитуватиме у користувача
// логін за допомогою prompt і виводить результат в консоль браузера

// Після цього додайте перевірку введеного користувачем значення:
// Якщо відвідувач вводить "Адмін",
// то prompt запитує пароль (не забудьте зберігти його у змінну для подальшої перевірки).
// Якщо нічого не ввели або натиснули Cancel,
// Вивести в alert строку "Скасовано"
// В іншому випадку вивести в alert рядок "Я вас не знаю"

// Пароль перевіряти так:
// Якщо введено пароль "Я головний",
// то вивести в alert рядок "Добрий день!",
// в іншому випадку вивести в alert рядок "Невірний пароль!"

// const login = prompt('Введіть логін');
// console.log(login);

// let password;

// if (login === 'Адмін') {
//     const password = prompt('Введіть пароль');
//     console.log(password);
//     if (password === 'Я головний') {
//         alert('Добрий день!');
//     } else {
//         alert('Невірний пароль')
//     }
// } else if (login === '' || login === null ) {
//     alert('Скасовано');
// } else {
//     alert('Я вас не знаю');
// }


// Завдання 6:
// Використайте цикл while, щоб вивести в console всі числа від 0 до 20 включно.

// let number = 0;

// while (number <= 20) {    
//     console.log(number);
//     number += 1;
// }


// Завдання 7:
// Напишіть функцію getNumbers(min, max), що приймає 2 параметри - 
// мінімальне і максимальне число відповідно.
// Напишіть цикл всередині функції, який виводить у консоль
// всі числа від max до min за спаданням.
// Окрім цього, підрахуйте суму всіх парних чисел в цьому циклі
// і поверніть її з функції.

// function getNumbers(min, max) {
//     let num = 0
//     for (let i = max; i >= min; i--) {
//         console.log(i)
//         if (i % 2 === 0) {
//             num += i;
//         }

//     }
//     return (num);
// }

// console.log(getNumbers(0, 25));

// Завдання 8:
// Напишіть функцію min(a, b), яка приймає 2 числа і повертає меньше з них.
// Потрібно додати перевірку, що функція отримує саме числа, в іншому випадку
// повертати з функції рядок - 'Not a number!'.

// function min(a, b) {
//     if (typeof (a) !== 'number' || typeof (b) !== 'number') {
//         return 'Not a number'
//     }

//     return Math.min(a, b)
// }

// console.log(min(153, 76));